Revit 2024 API
ItemSelectionDialogResult Enumeration
 An enumerated type listing the possible responses from a prompted dialog where the user is asked to select one or more items.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Since: 2017
Syntax
C#
public enum ItemSelectionDialogResult
Visual Basic
Public Enumeration ItemSelectionDialogResult
Visual C++
public enum class ItemSelectionDialogResult
Members
Member name | Description
Confirmed |  The user selected one or more item(s) from the prompted dialog and confirmed the selection. The selected item(s) are available from the dialog interfaces.
Canceled |  The user canceled the prompted dialog. No selected item(s) are available from the dialog interfaces.
See Also
Autodesk.Revit.UI Namespace